In [1]:
import sqlite3

In [2]:
#con = sqlite3.connect('./data/survey.db')
con = sqlite3.connect('./data/company.db')

In [3]:
cur = con.cursor()

In [4]:
sql_command = """ CREATE TABLE employee(
                staff_number INTEGER,
                fname VARCHAR(20),
                lname VARCHAR(20),
                DOB DATE)
              """

In [5]:
cur.execute(sql_command)

In [6]:
sql_command = """ SELECT * FROM employee"""

In [7]:
cur.execute(sql_command)

In [8]:
cur.fetchall()

[]

In [9]:
sql_command = """ INSERT INTO employee(staff_number, fname, lname, DOB)
                  values (1,'John', 'Doe', '2000-01-01')
              """

In [10]:
cur.execute(sql_command)

In [11]:
cur.execute(""" SELECT * FROM employee""")

In [12]:
cur.fetchall()

[(1, 'John', 'Doe', '2000-01-01')]

In [14]:
con.commit()

In [15]:
con.close()

In [16]:
con2 = sqlite3.connect('./data/test.db')

In [17]:
cur2 = con2.cursor()

In [18]:
sql_command = """
              CREATE TABLE pickle(
              harvest DATE,
              color VARCHAR(20))
              """

In [19]:
cur2.execute(sql_command)

In [21]:
con2.commit()

In [33]:
con2.close()

In [25]:
import pandas as pd

In [30]:
con=sqlite3.connect('./data/survey.db')
cur = con.cursor()

In [32]:
cur.execute("""SELECT * FROM person""")
cur.fetchall()

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

In [34]:
cur.execute("""SELECT name FROM sqlite_master WHERE TYPE='table'""")
cur.fetchall()

[('Person',), ('Site',), ('Visited',), ('Survey',)]

In [35]:
query = """SELECT * FROM person"""
df_person = pd.read_sql_query(query, con)

In [37]:
df_person

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [40]:
new_con = sqlite3.connect('./data/test.db')

In [41]:
df_person.to_sql('person_df', new_con)

In [42]:
new_con.close()

In [45]:
con = sqlite3.connect('./data/test.db')
#query = """SELECT * FROM person_df"""
query = """SELECT * FROM sqlite_master"""
df_aux = pd.read_sql_query(query, con)

In [46]:
df_aux

,type,name,tbl_name,rootpage,sql
0,table,pickle,pickle,2,CREATE TABLE pickle(\n harvest DA...
1,table,person_df,person_df,3,"CREATE TABLE ""person_df"" (\n""index"" INTEGER,\n..."
2,index,ix_person_df_index,person_df,4,"CREATE INDEX ""ix_person_df_index""ON ""person_df..."